# IneligibleElementsInAssembly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..IneligibleElementsInAssembly Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Ineligible elements in assembly.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IneligibleElementsInAssembly { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IneligibleElementsInAssembly As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IneligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace